; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	thermograph0 - mode
	spectrograph1 - mode
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 112)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 131)
	(= (data Star5 infrared2) 164)
	(= (data Phenomenon6 infrared2) 110)
	(= (data Phenomenon7 infrared2) 197)
	(= (data Phenomenon8 infrared2) 174)
	(= (data Phenomenon9 infrared2) 36)
	(= (data Star5 thermograph0) 18)
	(= (data Phenomenon6 thermograph0) 137)
	(= (data Phenomenon7 thermograph0) 48)
	(= (data Phenomenon8 thermograph0) 223)
	(= (data Phenomenon9 thermograph0) 88)
	(= (data Star5 spectrograph1) 180)
	(= (data Phenomenon6 spectrograph1) 126)
	(= (data Phenomenon7 spectrograph1) 76)
	(= (data Phenomenon8 spectrograph1) 76)
	(= (data Phenomenon9 spectrograph1) 188)
	(= (slew_time Star3 GroundStation0) 2.297)
	(= (slew_time GroundStation0 Star3) 2.297)
	(= (slew_time Star3 Star1) 89.7)
	(= (slew_time Star1 Star3) 89.7)
	(= (slew_time Star3 GroundStation2) 12.73)
	(= (slew_time GroundStation2 Star3) 12.73)
	(= (slew_time GroundStation4 GroundStation0) 1.907)
	(= (slew_time GroundStation0 GroundStation4) 1.907)
	(= (slew_time GroundStation4 Star1) 7.35)
	(= (slew_time Star1 GroundStation4) 7.35)
	(= (slew_time GroundStation4 GroundStation2) 57.97)
	(= (slew_time GroundStation2 GroundStation4) 57.97)
	(= (slew_time GroundStation4 Star3) 48.71)
	(= (slew_time Star3 GroundStation4) 48.71)
	(= (slew_time GroundStation2 GroundStation0) 1.94)
	(= (slew_time GroundStation0 GroundStation2) 1.94)
	(= (slew_time GroundStation2 Star1) 23.95)
	(= (slew_time Star1 GroundStation2) 23.95)
	(= (slew_time Star1 GroundStation0) 16.39)
	(= (slew_time GroundStation0 Star1) 16.39)
	(= (slew_time Star5 GroundStation0) 5.389)
	(= (slew_time GroundStation0 Star5) 5.389)
	(= (slew_time Star5 Star1) 26.31)
	(= (slew_time Star1 Star5) 26.31)
	(= (slew_time Star5 GroundStation2) 57.9)
	(= (slew_time GroundStation2 Star5) 57.9)
	(= (slew_time Star5 Star3) 48.38)
	(= (slew_time Star3 Star5) 48.38)
	(= (slew_time Star5 GroundStation4) 11.67)
	(= (slew_time GroundStation4 Star5) 11.67)
	(= (slew_time Phenomenon6 GroundStation0) 43.74)
	(= (slew_time GroundStation0 Phenomenon6) 43.74)
	(= (slew_time Phenomenon6 Star1) 66.57)
	(= (slew_time Star1 Phenomenon6) 66.57)
	(= (slew_time Phenomenon6 GroundStation2) 2.571)
	(= (slew_time GroundStation2 Phenomenon6) 2.571)
	(= (slew_time Phenomenon6 Star3) 47.13)
	(= (slew_time Star3 Phenomenon6) 47.13)
	(= (slew_time Phenomenon6 GroundStation4) 40.84)
	(= (slew_time GroundStation4 Phenomenon6) 40.84)
	(= (slew_time Phenomenon6 Star5) 38.25)
	(= (slew_time Star5 Phenomenon6) 38.25)
	(= (slew_time Phenomenon7 GroundStation0) 57.45)
	(= (slew_time GroundStation0 Phenomenon7) 57.45)
	(= (slew_time Phenomenon7 Star1) 27.17)
	(= (slew_time Star1 Phenomenon7) 27.17)
	(= (slew_time Phenomenon7 GroundStation2) 11.41)
	(= (slew_time GroundStation2 Phenomenon7) 11.41)
	(= (slew_time Phenomenon7 Star3) 76.44)
	(= (slew_time Star3 Phenomenon7) 76.44)
	(= (slew_time Phenomenon7 GroundStation4) 74.22)
	(= (slew_time GroundStation4 Phenomenon7) 74.22)
	(= (slew_time Phenomenon7 Star5) 1.67)
	(= (slew_time Star5 Phenomenon7) 1.67)
	(= (slew_time Phenomenon7 Phenomenon6) 74.21)
	(= (slew_time Phenomenon6 Phenomenon7) 74.21)
	(= (slew_time Phenomenon8 GroundStation0) 1.37)
	(= (slew_time GroundStation0 Phenomenon8) 1.37)
	(= (slew_time Phenomenon8 Star1) 15.72)
	(= (slew_time Star1 Phenomenon8) 15.72)
	(= (slew_time Phenomenon8 GroundStation2) 1.439)
	(= (slew_time GroundStation2 Phenomenon8) 1.439)
	(= (slew_time Phenomenon8 Star3) 43.81)
	(= (slew_time Star3 Phenomenon8) 43.81)
	(= (slew_time Phenomenon8 GroundStation4) 5.226)
	(= (slew_time GroundStation4 Phenomenon8) 5.226)
	(= (slew_time Phenomenon8 Star5) 44.54)
	(= (slew_time Star5 Phenomenon8) 44.54)
	(= (slew_time Phenomenon8 Phenomenon6) 43.37)
	(= (slew_time Phenomenon6 Phenomenon8) 43.37)
	(= (slew_time Phenomenon8 Phenomenon7) 50.78)
	(= (slew_time Phenomenon7 Phenomenon8) 50.78)
	(= (slew_time Phenomenon9 GroundStation0) 4.074)
	(= (slew_time GroundStation0 Phenomenon9) 4.074)
	(= (slew_time Phenomenon9 Star1) 31.97)
	(= (slew_time Star1 Phenomenon9) 31.97)
	(= (slew_time Phenomenon9 GroundStation2) 6.479)
	(= (slew_time GroundStation2 Phenomenon9) 6.479)
	(= (slew_time Phenomenon9 Star3) 5.39)
	(= (slew_time Star3 Phenomenon9) 5.39)
	(= (slew_time Phenomenon9 GroundStation4) 76.12)
	(= (slew_time GroundStation4 Phenomenon9) 76.12)
	(= (slew_time Phenomenon9 Star5) 48.37)
	(= (slew_time Star5 Phenomenon9) 48.37)
	(= (slew_time Phenomenon9 Phenomenon6) 25.4)
	(= (slew_time Phenomenon6 Phenomenon9) 25.4)
	(= (slew_time Phenomenon9 Phenomenon7) 35.98)
	(= (slew_time Phenomenon7 Phenomenon9) 35.98)
	(= (slew_time Phenomenon9 Phenomenon8) 46.52)
	(= (slew_time Phenomenon8 Phenomenon9) 46.52)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Star1)
	(have_image Star5 spectrograph1)
	(have_image Phenomenon6 thermograph0)
	(have_image Phenomenon7 infrared2)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon9 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 groundstation0 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 131 to 129.06, (fuel-used) from 0 to 1.94
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon8 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 129.06 to 127.69, (fuel-used) from 1.94 to 3.31
   goals met: 0 of 6
5. (take_image satellite1 phenomenon8 instrument3 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   changed: (data_capacity satellite1) from 1000 to 777, (data-stored) from 0 to 223
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 127.69 to 81.17, (fuel-used) from 3.31 to 49.83
   goals met: 1 of 6
7. (take_image satellite1 phenomenon9 instrument3 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   changed: (data_capacity satellite1) from 777 to 689, (data-stored) from 223 to 311
   goals met: 2 of 6
8. (turn_to satellite1 groundstation0 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 81.17 to 77.096, (fuel-used) from 49.83 to 53.904
   goals met: 2 of 6
9. (turn_to satellite1 phenomenon6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 77.096 to 33.356, (fuel-used) from 53.904 to 97.644
   goals met: 2 of 6
10. (take_image satellite1 phenomenon6 instrument3 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   changed: (data_capacity satellite1) from 689 to 552, (data-stored) from 311 to 448
   goals met: 3 of 6
11. (turn_to satellite1 groundstation2 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 33.356 to 30.785, (fuel-used) from 97.644 to 100.215
   goals met: 3 of 6
12. (turn_to satellite1 star1 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 30.785 to 6.835, (fuel-used) from 100.215 to 124.165
   goals met: 4 of 6
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 6
14. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 112 to 110.33, (fuel-used) from 124.165 to 125.835
   goals met: 4 of 6
15. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 110.33 to 108.66, (fuel-used) from 125.835 to 127.505
   goals met: 4 of 6
16. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 108.66 to 106.99, (fuel-used) from 127.505 to 129.175
   goals met: 4 of 6
17. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 106.99 to 105.32, (fuel-used) from 129.175 to 130.845
   goals met: 4 of 6
18. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 105.32 to 103.65, (fuel-used) from 130.845 to 132.515
   goals met: 4 of 6
19. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 103.65 to 101.98, (fuel-used) from 132.515 to 134.185
   goals met: 4 of 6
20. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 101.98 to 100.31, (fuel-used) from 134.185 to 135.855
   goals met: 4 of 6
21. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 100.31 to 98.64, (fuel-used) from 135.855 to 137.525
   goals met: 4 of 6
22. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 98.64 to 96.97, (fuel-used) from 137.525 to 139.195
   goals met: 4 of 6
23. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 96.97 to 95.3, (fuel-used) from 139.195 to 140.865
   goals met: 4 of 6
24. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 95.3 to 93.63, (fuel-used) from 140.865 to 142.535
   goals met: 4 of 6
25. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 93.63 to 91.96, (fuel-used) from 142.535 to 144.205
   goals met: 4 of 6
26. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 91.96 to 90.29, (fuel-used) from 144.205 to 145.875
   goals met: 4 of 6
27. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 90.29 to 88.62, (fuel-used) from 145.875 to 147.545
   goals met: 4 of 6
28. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 88.62 to 86.95, (fuel-used) from 147.545 to 149.215
   goals met: 4 of 6
29. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 86.95 to 85.28, (fuel-used) from 149.215 to 150.885
   goals met: 4 of 6
30. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 85.28 to 83.61, (fuel-used) from 150.885 to 152.555
   goals met: 4 of 6
31. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 83.61 to 81.94, (fuel-used) from 152.555 to 154.225
   goals met: 4 of 6
32. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 81.94 to 80.27, (fuel-used) from 154.225 to 155.895
   goals met: 4 of 6
33. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 80.27 to 78.6, (fuel-used) from 155.895 to 157.565
   goals met: 4 of 6
34. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 78.6 to 76.93, (fuel-used) from 157.565 to 159.235
   goals met: 4 of 6
35. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 76.93 to 75.26, (fuel-used) from 159.235 to 160.905
   goals met: 4 of 6
36. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 75.26 to 73.59, (fuel-used) from 160.905 to 162.575
   goals met: 4 of 6
37. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 73.59 to 71.92, (fuel-used) from 162.575 to 164.245
   goals met: 4 of 6
38. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 71.92 to 70.25, (fuel-used) from 164.245 to 165.915
   goals met: 4 of 6
39. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 70.25 to 68.58, (fuel-used) from 165.915 to 167.585
   goals met: 4 of 6
40. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 68.58 to 66.91, (fuel-used) from 167.585 to 169.255
   goals met: 4 of 6
41. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 66.91 to 65.24, (fuel-used) from 169.255 to 170.925
   goals met: 4 of 6
42. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 65.24 to 63.57, (fuel-used) from 170.925 to 172.595
   goals met: 4 of 6
43. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 63.57 to 61.9, (fuel-used) from 172.595 to 174.265
   goals met: 4 of 6
44. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 61.9 to 60.23, (fuel-used) from 174.265 to 175.935
   goals met: 4 of 6
45. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 60.23 to 58.56, (fuel-used) from 175.935 to 177.605
   goals met: 4 of 6
46. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 58.56 to 56.89, (fuel-used) from 177.605 to 179.275
   goals met: 4 of 6
47. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 56.89 to 55.22, (fuel-used) from 179.275 to 180.945
   goals met: 4 of 6
48. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 55.22 to 53.55, (fuel-used) from 180.945 to 182.615
   goals met: 4 of 6
49. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 53.55 to 51.88, (fuel-used) from 182.615 to 184.285
   goals met: 4 of 6
50. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 51.88 to 50.21, (fuel-used) from 184.285 to 185.955
   goals met: 4 of 6
51. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 50.21 to 48.54, (fuel-used) from 185.955 to 187.625
   goals met: 4 of 6
52. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 48.54 to 46.87, (fuel-used) from 187.625 to 189.295
   goals met: 4 of 6
53. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 46.87 to 45.2, (fuel-used) from 189.295 to 190.965
   goals met: 4 of 6
54. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 45.2 to 43.53, (fuel-used) from 190.965 to 192.635
   goals met: 4 of 6
55. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 43.53 to 41.86, (fuel-used) from 192.635 to 194.305
   goals met: 4 of 6
56. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 41.86 to 40.19, (fuel-used) from 194.305 to 195.975
   goals met: 4 of 6
57. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 40.19 to 38.52, (fuel-used) from 195.975 to 197.645
   goals met: 4 of 6
58. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 38.52 to 36.85, (fuel-used) from 197.645 to 199.315
   goals met: 4 of 6
59. (turn_to satellite0 groundstation4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation4)
   changed: (fuel satellite0) from 36.85 to 25.18, (fuel-used) from 199.315 to 210.985
   goals met: 4 of 6
60. (turn_to satellite0 star1 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 25.18 to 17.83, (fuel-used) from 210.985 to 218.335
   goals met: 4 of 6
61. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 4 of 6
62. (turn_to satellite0 groundstation4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation4)
   changed: (fuel satellite0) from 17.83 to 10.48, (fuel-used) from 218.335 to 225.685
   goals met: 4 of 6
63. (turn_to satellite0 groundstation0 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 10.48 to 8.573, (fuel-used) from 225.685 to 227.592
   goals met: 4 of 6
64. (turn_to satellite0 star5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 8.573 to 3.184, (fuel-used) from 227.592 to 232.981
   goals met: 4 of 6
65. (take_image satellite0 star5 instrument0 spectrograph1)
   added: (have_image star5 spectrograph1)
   changed: (data_capacity satellite0) from 1000 to 820, (data-stored) from 448 to 628
   goals met: 5 of 6
66. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 3.184 to 1.514, (fuel-used) from 232.981 to 234.651
   goals met: 5 of 6
67. (take_image satellite0 phenomenon7 instrument0 infrared2)
   added: (have_image phenomenon7 infrared2)
   changed: (data_capacity satellite0) from 820 to 623, (data-stored) from 628 to 825
   goals met: 6 of 6
